ErpTest/src/AccumulationRegisters/ТоварыПереданныеПереработчику/ТоварыПереданныеПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыПереданныеПереработчику</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/ТипыОперацийВводаОстатков/ТипыОперацийВводаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийВводаОстатков</name>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМПоРозничнойВыручке</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВКассах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПодотчетников</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНаБанковскихСчетах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоАвансам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоРеализациям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиСобственныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПереданныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПолученныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПерерасходыПодотчетныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваКПоступлениюОтЭквайера</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПереданнойКлиентам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПринятойОтПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеАдресногоХраненияОстатков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеСкладскихПомещений</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоДоговорамКредитовИДепозитов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхПереработчикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыйРезультатЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОптовыеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>РозничныеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиАрендованныхОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВзаиморасчетовПоДоговорамЛизинга</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНДСПоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходовУСН</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоМатериалам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоТоварам</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/AccumulationRegisters/ТоварыПереданныеПереработчику/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ТоварыПереданныеПереработчику";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводОстатков.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ВводОстатков КАК ВводОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатков.Товары КАК ВводОстатковТовары
	|		ПО ВводОстатков.Ссылка = ВводОстатковТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыПереданныеПереработчику КАК ТоварыПереданныеПереработчику
	|		ПО ВводОстатков.Ссылка = ТоварыПереданныеПереработчику.Регистратор
	|			И (ВводОстатковТовары.АналитикаУчетаНоменклатуры = ТоварыПереданныеПереработчику.АналитикаУчетаНоменклатуры)
	|ГДЕ
	|	ВводОстатков.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийВводаОстатков.ОстаткиМатериаловПереданныхПереработчикам)
	|	И ВводОстатков.ОтражатьВОперативномУчете
	|	И ВводОстатковТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И ТоварыПереданныеПереработчику.Регистратор ЕСТЬ NULL";
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"), ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ТоварыПереданныеПереработчику";
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ВводОстатков");
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы, ПолноеИмяРегистра, Параметры.Очередь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
